app/Controllers/admin/ArtikelPBN.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        // Ambil artikel terbaru dan data terkait PBN
        $data['artikels'] = $this->artikelpbnModel->getArtikelTerbaru();

        // Pastikan bahwa data id_pbn juga diambil dengan benar
        foreach ($data['artikels'] as &$artikel) {
            if (!empty($artikel->id_pbn)) {
                // Cek apakah data id_pbn ada
                $id_pbn_data = $this->pbnModel->find($artikel->id_pbn);
---
SELECT *
FROM `tb_pbn`
WHERE `tb_pbn`.`id_pbn` = '1'

    public function tambah()
    {
        // Periksa apakah pengguna sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        // Ambil data PBN dari database
        $pbnData = $this->pbnModel->findAll(); // Pastikan $pbnModel sudah diinisialisasi
---
SELECT *
FROM `tb_pbn`