app/Controllers/admin/EmailPBN.php

SELECT *
FROM `tb_emailpbn`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        $data = [
            'emails' => $this->emailPbnModel->findAll(),
        ];