app/Controllers/admin/EmailPBN.php

SELECT *
FROM `tb_emailpbn`
ORDER BY `id_emailpbn` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tb_emailpbn`
---
    public function index()
{
    if (!session()->get('logged_in')) {
        return redirect()->to(base_url('login'));
    }

    // Konfigurasi pagination
    $perPage = 10; // Jumlah data per halaman
    $currentPage = $this->request->getVar('page') ?? 1; // Ambil halaman saat ini

    // Ambil data dengan paginate
    $emails = $this->emailPbnModel
        ->orderBy('id_emailpbn', 'DESC') // Urutkan jika diperlukan
        ->paginate($perPage);

INSERT INTO `tb_emailpbn` (`creator_emailpbn`, `tanggalbuat_emailpbn`, `alamat_emailpbn`, `password_emailpbn`, `infolain_emailpbn`) VALUES ('Siti Putri Diana', '2024-12-09 07:23:58', 'diana@gmail.com', 'dianaputri', 'blogspot')
---
    public function proses_tambah()
{
    if (!session()->get('logged_in')) {
        return redirect()->to(base_url('login'));
    }

    // Validasi input
    if (!$this->validate([
        'creator_emailpbn' => 'required',
        'alamat_emailpbn' => 'required|valid_email',
        'password_emailpbn' => 'required',
    ])) {
        session()->setFlashdata('error', $this->validator->listErrors());
        return redirect()->back()->withInput();
    }

    $data = [
        'creator_emailpbn' => $this->request->getVar('creator_emailpbn'),
        'tanggalbuat_emailpbn' => date('Y-m-d H:i:s'),
        'alamat_emailpbn' => $this->request->getVar('alamat_emailpbn'),
        'password_emailpbn' => $this->request->getVar('password_emailpbn'), // Simpan password aslinya
        'infolain_emailpbn' => $this->request->getVar('infolain_emailpbn'),
    ];

    $this->emailPbnModel->insert($data);

SELECT *
FROM `tb_emailpbn`
WHERE `tb_emailpbn`.`id_emailpbn` = '21'
---
    public function edit($id_emailpbn)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        $emailData = $this->emailPbnModel->find($id_emailpbn);