app/Controllers/admin/PBN.php

    public function index()
{
    // Cek apakah user sudah login
    if (!session()->get('logged_in')) {
        return redirect()->to(base_url('login'));
    }

    // Inisialisasi model
    $pbnModel = new \App\Models\PBNModel();
    $emailModel = new \App\Models\EmailPbnModel(); // Pastikan EmailPbnModel sudah dibuat

    // Siapkan data untuk dikirim ke view
    $data = [
        'pbn' => $pbnModel->paginate(10), // Pagination: 10 data per halaman
        'pager' => $pbnModel->pager,      // Mengambil instance pager untuk pagination
        'emailModel' => $emailModel       // Kirimkan model email ke view
    ];
---
SELECT *
FROM `tb_emailpbn`
SELECT *
FROM `tb_pbn`

    public function tambah()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        // Ambil data email yang tersedia untuk dropdown
        $emails = $this->emailPbnModel->findAll();
---
SELECT *
FROM `tb_emailpbn`

    public function proses_tambah()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        // Validasi input
        if (!$this->validate([
            'email_pbn' => 'required',
            'creator_pbn' => 'required',
            'alamat_pbn' => 'required',
            'tema_pbn' => 'required',
        ])) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }

        // Ambil data dari form
        $data = [
            'id_emailpbn' => $this->request->getVar('email_pbn'), // Menyimpan id_emailpbn
            'creator_pbn' => $this->request->getVar('creator_pbn'),
            'tanggalbuat_pbn' => date('Y-m-d H:i:s'),
            'alamat_pbn' => $this->request->getVar('alamat_pbn'),
            'tema_pbn' => $this->request->getVar('tema_pbn'),
        ];

        // Simpan data PBN
        $this->pbnModel->save($data);
---
INSERT INTO `tb_pbn` (`id_emailpbn`, `creator_pbn`, `tanggalbuat_pbn`, `alamat_pbn`, `tema_pbn`) VALUES ('4', 'Siti Putri Diana', '2024-12-09 07:26:05', 'https://wisatadiblog.blogspot.com/', 'Wisata')

    public function delete($id_pbn)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        $pbnData = $this->pbnModel->find($id_pbn);
        if (!$pbnData) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('PBN tidak ditemukan.');
        }

        $this->pbnModel->delete($id_pbn);
---
SELECT *
FROM `tb_pbn`
WHERE `tb_pbn`.`id_pbn` = '1'
DELETE FROM `tb_pbn`
WHERE `id_pbn` IN ('1')