app/Views/admin/pbn/index.php


                                <tbody>
                                    <?php foreach ($pbn as $data) :
                                        $emailData = $emailModel->find($data->id_emailpbn);
---
SELECT *
FROM `tb_emailpbn`
WHERE `tb_emailpbn`.`id_emailpbn` = '3'