app/Models/ArtikelpbnModel.php

    public function getArtikelTerbaru()
    {
        return $this->db->table('artikel_pbn')
            ->join('tb_pbn', 'tb_pbn.id_pbn = artikel_pbn.id_pbn', 'left') // Join dengan tabel tb_pbn
            ->select('artikel_pbn.*, tb_pbn.alamat_pbn') // Tambahkan alamat_pbn
            ->orderBy('artikel_pbn.id_artikelpbn', 'desc') // Urutkan berdasarkan id_artikelpbn secara descending
            ->get()
            ->getResult(); // Kembalikan hasil query
---
SELECT `artikel_pbn`.*, `tb_pbn`.`alamat_pbn`
FROM `artikel_pbn`
LEFT JOIN `tb_pbn` ON `tb_pbn`.`id_pbn` = `artikel_pbn`.`id_pbn`
ORDER BY `artikel_pbn`.`id_artikelpbn` DESC