app/Models/EmailPbnModel.php

    public function getAllEmails()
    {
        return $this->orderBy('id_emailpbn', 'ASC')->findAll();
---
SELECT *
FROM `tb_emailpbn`
ORDER BY `id_emailpbn` ASC